title: 'DUEL - T1078.004 - Defense Evasion - Round 3'
id: 'a4a14e0b-7c45-55a5-8284-02c76c1b3726'
status: experimental
description: 'Auto-generated by DUEL adversarial testing. Technique: T1078.004 (Valid Accounts: Cloud Accounts). Tactic: Defense Evasion, Persistence, Privilege Escalation, Initial Access. Simulation detection rate: 100%. Evasion rate: 0%. Survived round 3 of adversarial LLM testing.'
author: DUEL Framework — adversarial generation
date: 2026/05/02
modified: 2026/05/02
logsource:
  category: authentication
  product: azure
detection:
  selection:
    IPAddress:
      - 162.243.103.246
      - 50.16.16.211
      - 34.204.119.63
      - 178.62.3.223
      - 27.133.154.218
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorized security testing
level: low
tags:
  - attack.t1078.004
  - attack.defense_evasion
