title: 'DUEL - T1136.003 - Persistence - Round 1'
id: '720b9d42-2ab9-50d2-8280-1ad4864666bd'
status: experimental
description: 'Auto-generated by DUEL adversarial testing. Technique: T1136.003 (Create Account: Cloud Account). Tactic: Persistence. Simulation detection rate: 100%. Evasion rate: 0%. Survived round 1 of adversarial LLM testing.'
author: DUEL Framework — adversarial generation
date: 2026/05/02
modified: 2026/05/02
logsource:
  category: authentication
  product: azure
detection:
  selection:
    AppDisplayName|contains: B2B Guest Invitation
    AuthenticationRequirement|contains: MFA Not Required
    ResultType: 0
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorized security testing
level: low
tags:
  - attack.t1136.003
  - attack.persistence
