title: 'DUEL - T1133 - Initial Access - Round 1'
id: 'c9dcc8c1-603e-5302-beb6-549ef3e23fe9'
status: experimental
description: 'Auto-generated by DUEL adversarial testing. Technique: T1133 (External Remote Services). Tactic: Initial Access, Persistence. Simulation detection rate: 100%. Evasion rate: 0%. Survived round 1 of adversarial LLM testing.'
author: DUEL Framework — adversarial generation
date: 2026/05/02
modified: 2026/05/02
logsource:
  category: authentication
  product: azure
detection:
  selection:
    AppDisplayName|contains:
      - Azure Virtual Desktop
      - Azure Bastion
    not:
      - 162.243.103.246
      - 50.16.16.211
      - 34.204.119.63
      - 178.62.3.223
      - 27.133.154.218
    not|contains:
      - 'python-requests/'
      - 'Go-http-client/'
      - curl/
      - 'libwww-perl/'
      - masscan/
      - zgrab/
      - nmap scripting engine
      - sqlmap/
      - nikto/
      - dirbuster
      - gobuster
      - nuclei/
      - httpx/
      - wfuzz/
      - ffuf/
    ResultType: 0
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorized security testing
level: low
tags:
  - attack.t1133
  - attack.initial_access
