title: 'DUEL - T1537 - Exfiltration - Round 3'
id: 'ef83d505-3e4e-5c84-b60b-79dc9f0cae2e'
status: experimental
description: 'Auto-generated by DUEL adversarial testing. Technique: T1537 (Transfer Data to Cloud Account). Tactic: Exfiltration. Simulation detection rate: 100%. Evasion rate: 0%. Survived round 3 of adversarial LLM testing.'
author: DUEL Framework — adversarial generation
date: 2026/05/02
modified: 2026/05/02
logsource:
  category: authentication
  product: azure
detection:
  selection:
    UserAgent|contains: 'python-requests/2.28.0'
    AuthenticationRequirement: singleFactorAuthentication
    AppDisplayName: '"Microsoft'
    RiskLevelDuringSignIn: none
    ConditionalAccessStatus: notApplied
    CountryOrRegion: RU
    ResultType: 0
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorized security testing
level: low
tags:
  - attack.t1537
  - attack.exfiltration
